7767517
156 175
Input            input0                   0 1 input0
Convolution      Conv_0                   1 1 input0 593 0=24 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=648
ReLU             Relu_1                   1 1 593 317
Split            splitncnn_0              1 2 317 317_splitncnn_0 317_splitncnn_1
ConvolutionDepthWise Conv_2                   1 1 317_splitncnn_1 596 0=24 1=5 11=5 2=1 12=1 3=1 13=1 4=2 14=2 15=2 16=2 5=1 6=600 7=24
ReLU             Relu_3                   1 1 596 320
Convolution      Conv_4                   1 1 320 599 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=576
BinaryOp         Add_5                    2 1 317_splitncnn_0 599 323 0=0
ReLU             Relu_6                   1 1 323 324
Split            splitncnn_1              1 2 324 324_splitncnn_0 324_splitncnn_1
ConvolutionDepthWise Conv_7                   1 1 324_splitncnn_1 602 0=24 1=5 11=5 2=1 12=1 3=1 13=1 4=2 14=2 15=2 16=2 5=1 6=600 7=24
ReLU             Relu_8                   1 1 602 327
Convolution      Conv_9                   1 1 327 605 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=576
BinaryOp         Add_10                   2 1 324_splitncnn_0 605 330 0=0
ReLU             Relu_11                  1 1 330 331
Split            splitncnn_2              1 2 331 331_splitncnn_0 331_splitncnn_1
ConvolutionDepthWise Conv_12                  1 1 331_splitncnn_1 608 0=24 1=5 11=5 2=1 12=1 3=2 13=2 4=2 14=2 15=2 16=2 5=1 6=600 7=24
ReLU             Relu_13                  1 1 608 334
Convolution      Conv_14                  1 1 334 611 0=48 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1152
Pooling          MaxPool_15               1 1 331_splitncnn_0 337 0=0 1=2 11=2 2=2 12=2 3=0 13=0 14=0 15=0 5=0
Convolution      Conv_16                  1 1 337 614 0=48 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1152
ReLU             Relu_17                  1 1 614 340
BinaryOp         Add_18                   2 1 340 611 341 0=0
ReLU             Relu_19                  1 1 341 342
Split            splitncnn_3              1 2 342 342_splitncnn_0 342_splitncnn_1
ConvolutionDepthWise Conv_20                  1 1 342_splitncnn_1 617 0=48 1=5 11=5 2=1 12=1 3=1 13=1 4=2 14=2 15=2 16=2 5=1 6=1200 7=48
ReLU             Relu_21                  1 1 617 345
Convolution      Conv_22                  1 1 345 620 0=48 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2304
BinaryOp         Add_23                   2 1 342_splitncnn_0 620 348 0=0
ReLU             Relu_24                  1 1 348 349
Split            splitncnn_4              1 2 349 349_splitncnn_0 349_splitncnn_1
ConvolutionDepthWise Conv_25                  1 1 349_splitncnn_1 623 0=48 1=5 11=5 2=1 12=1 3=1 13=1 4=2 14=2 15=2 16=2 5=1 6=1200 7=48
ReLU             Relu_26                  1 1 623 352
Convolution      Conv_27                  1 1 352 626 0=48 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2304
BinaryOp         Add_28                   2 1 349_splitncnn_0 626 355 0=0
ReLU             Relu_29                  1 1 355 356
Split            splitncnn_5              1 2 356 356_splitncnn_0 356_splitncnn_1
ConvolutionDepthWise Conv_30                  1 1 356_splitncnn_1 629 0=48 1=5 11=5 2=1 12=1 3=2 13=2 4=2 14=2 15=2 16=2 5=1 6=1200 7=48
ReLU             Relu_31                  1 1 629 359
Convolution      Conv_32                  1 1 359 632 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1152
HardSwish        Mul_40                   1 1 632 369 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise Conv_41                  1 1 369 635 0=24 1=5 11=5 2=1 12=1 3=1 13=1 4=2 14=2 15=2 16=2 5=1 6=600 7=24
ReLU             Relu_42                  1 1 635 372
Convolution      Conv_43                  1 1 372 638 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2304
ReLU             Relu_44                  1 1 638 375
Pooling          MaxPool_45               1 1 356_splitncnn_0 376 0=0 1=2 11=2 2=2 12=2 3=0 13=0 14=0 15=0 5=0
Convolution      Conv_46                  1 1 376 641 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4608
ReLU             Relu_47                  1 1 641 379
BinaryOp         Add_48                   2 1 379 375 380 0=0
ReLU             Relu_49                  1 1 380 381
Split            splitncnn_6              1 2 381 381_splitncnn_0 381_splitncnn_1
ConvolutionDepthWise Conv_50                  1 1 381_splitncnn_1 644 0=96 1=5 11=5 2=1 12=1 3=1 13=1 4=2 14=2 15=2 16=2 5=1 6=2400 7=96
ReLU             Relu_51                  1 1 644 384
Convolution      Conv_52                  1 1 384 647 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2304
HardSwish        Mul_60                   1 1 647 394 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise Conv_61                  1 1 394 650 0=24 1=5 11=5 2=1 12=1 3=1 13=1 4=2 14=2 15=2 16=2 5=1 6=600 7=24
ReLU             Relu_62                  1 1 650 397
Convolution      Conv_63                  1 1 397 653 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2304
ReLU             Relu_64                  1 1 653 400
BinaryOp         Add_65                   2 1 381_splitncnn_0 400 401 0=0
ReLU             Relu_66                  1 1 401 402
Split            splitncnn_7              1 2 402 402_splitncnn_0 402_splitncnn_1
ConvolutionDepthWise Conv_67                  1 1 402_splitncnn_1 656 0=96 1=5 11=5 2=1 12=1 3=1 13=1 4=2 14=2 15=2 16=2 5=1 6=2400 7=96
ReLU             Relu_68                  1 1 656 405
Convolution      Conv_69                  1 1 405 659 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2304
HardSwish        Mul_77                   1 1 659 415 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise Conv_78                  1 1 415 662 0=24 1=5 11=5 2=1 12=1 3=1 13=1 4=2 14=2 15=2 16=2 5=1 6=600 7=24
ReLU             Relu_79                  1 1 662 418
Convolution      Conv_80                  1 1 418 665 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2304
ReLU             Relu_81                  1 1 665 421
BinaryOp         Add_82                   2 1 402_splitncnn_0 421 422 0=0
ReLU             Relu_83                  1 1 422 423
Split            splitncnn_8              1 3 423 423_splitncnn_0 423_splitncnn_1 423_splitncnn_2
ConvolutionDepthWise Conv_84                  1 1 423_splitncnn_2 668 0=96 1=5 11=5 2=1 12=1 3=2 13=2 4=2 14=2 15=2 16=2 5=1 6=2400 7=96
ReLU             Relu_85                  1 1 668 426
Convolution      Conv_86                  1 1 426 671 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2304
HardSwish        Mul_94                   1 1 671 436 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise Conv_95                  1 1 436 674 0=24 1=5 11=5 2=1 12=1 3=1 13=1 4=2 14=2 15=2 16=2 5=1 6=600 7=24
ReLU             Relu_96                  1 1 674 439
Convolution      Conv_97                  1 1 439 677 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2304
ReLU             Relu_98                  1 1 677 442
Pooling          MaxPool_99               1 1 423_splitncnn_1 443 0=0 1=2 11=2 2=2 12=2 3=0 13=0 14=0 15=0 5=0
Convolution      Conv_100                 1 1 443 680 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=9216
ReLU             Relu_101                 1 1 680 446
BinaryOp         Add_102                  2 1 446 442 447 0=0
ReLU             Relu_103                 1 1 447 448
Split            splitncnn_9              1 2 448 448_splitncnn_0 448_splitncnn_1
ConvolutionDepthWise Conv_104                 1 1 448_splitncnn_1 683 0=96 1=5 11=5 2=1 12=1 3=1 13=1 4=2 14=2 15=2 16=2 5=1 6=2400 7=96
ReLU             Relu_105                 1 1 683 451
Convolution      Conv_106                 1 1 451 686 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2304
HardSwish        Mul_114                  1 1 686 461 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise Conv_115                 1 1 461 689 0=24 1=5 11=5 2=1 12=1 3=1 13=1 4=2 14=2 15=2 16=2 5=1 6=600 7=24
ReLU             Relu_116                 1 1 689 464
Convolution      Conv_117                 1 1 464 692 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2304
ReLU             Relu_118                 1 1 692 467
BinaryOp         Add_119                  2 1 448_splitncnn_0 467 468 0=0
ReLU             Relu_120                 1 1 468 469
Split            splitncnn_10             1 2 469 469_splitncnn_0 469_splitncnn_1
ConvolutionDepthWise Conv_121                 1 1 469_splitncnn_1 695 0=96 1=5 11=5 2=1 12=1 3=1 13=1 4=2 14=2 15=2 16=2 5=1 6=2400 7=96
ReLU             Relu_122                 1 1 695 472
Convolution      Conv_123                 1 1 472 698 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2304
HardSwish        Mul_131                  1 1 698 482 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise Conv_132                 1 1 482 701 0=24 1=5 11=5 2=1 12=1 3=1 13=1 4=2 14=2 15=2 16=2 5=1 6=600 7=24
ReLU             Relu_133                 1 1 701 485
Convolution      Conv_134                 1 1 485 704 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2304
ReLU             Relu_135                 1 1 704 488
BinaryOp         Add_136                  2 1 469_splitncnn_0 488 489 0=0
ReLU             Relu_137                 1 1 489 490
Convolution      Conv_138                 1 1 423_splitncnn_0 707 0=48 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4608
ReLU             LeakyRelu_139            1 1 707 493 0=1.000000e-02
Convolution      Conv_140                 1 1 490 710 0=48 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4608
ReLU             LeakyRelu_141            1 1 710 496 0=1.000000e-02
Split            splitncnn_11             1 2 496 496_splitncnn_0 496_splitncnn_1
Interp           Resize_160               1 1 496_splitncnn_1 515 0=1 1=2.0 2=2.0
BinaryOp         Add_161                  2 1 493 515 516 0=0
Convolution      Conv_162                 1 1 516 713 0=48 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=20736
ReLU             LeakyRelu_163            1 1 713 519 0=1.000000e-02
Convolution      Conv_164                 1 1 519 716 0=24 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=10368
Split            splitncnn_12             1 2 716 716_splitncnn_0 716_splitncnn_1
Convolution      Conv_165                 1 1 716_splitncnn_1 719 0=12 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2592
ReLU             LeakyRelu_166            1 1 719 524 0=1.000000e-02
Convolution      Conv_167                 1 1 524 722 0=12 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1296
Split            splitncnn_13             1 2 722 722_splitncnn_0 722_splitncnn_1
Convolution      Conv_168                 1 1 722_splitncnn_1 725 0=12 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1296
ReLU             LeakyRelu_169            1 1 725 529 0=1.000000e-02
Convolution      Conv_170                 1 1 529 728 0=12 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1296
Concat           Concat_171               3 1 716_splitncnn_0 722_splitncnn_0 728 532 0=0
ReLU             Relu_172                 1 1 532 533
Split            splitncnn_14             1 2 533 533_splitncnn_0 533_splitncnn_1
Convolution      Conv_173                 1 1 496_splitncnn_0 731 0=24 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=10368
Split            splitncnn_15             1 2 731 731_splitncnn_0 731_splitncnn_1
Convolution      Conv_174                 1 1 731_splitncnn_1 734 0=12 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2592
ReLU             LeakyRelu_175            1 1 734 538 0=1.000000e-02
Convolution      Conv_176                 1 1 538 737 0=12 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1296
Split            splitncnn_16             1 2 737 737_splitncnn_0 737_splitncnn_1
Convolution      Conv_177                 1 1 737_splitncnn_1 740 0=12 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1296
ReLU             LeakyRelu_178            1 1 740 543 0=1.000000e-02
Convolution      Conv_179                 1 1 543 743 0=12 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1296
Concat           Concat_180               3 1 731_splitncnn_0 737_splitncnn_0 743 546 0=0
ReLU             Relu_181                 1 1 546 547
Split            splitncnn_17             1 2 547 547_splitncnn_0 547_splitncnn_1
Convolution      Conv_185                 1 1 533_splitncnn_1 551 0=8 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=3456
Permute          Transpose_186            1 1 551 552 0=3
Reshape          Reshape_189              1 1 552 559 0=4 1=-1
Convolution      Conv_190                 1 1 533_splitncnn_0 560 0=4 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1728
Permute          Transpose_191            1 1 560 561 0=3
Reshape          Reshape_194              1 1 561 568 0=2 1=-1
Convolution      Conv_198                 1 1 547_splitncnn_1 572 0=24 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=10368
Permute          Transpose_199            1 1 572 573 0=3
Reshape          Reshape_202              1 1 573 580 0=4 1=-1
Convolution      Conv_203                 1 1 547_splitncnn_0 581 0=12 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=5184
Permute          Transpose_204            1 1 581 582 0=3
Reshape          Reshape_207              1 1 582 589 0=2 1=-1
Concat           Concat_208               2 1 559 580 box 0=0
Concat           Concat_209               2 1 568 589 591 0=0
Softmax          Softmax_210              1 1 591 cls 0=1 1=1
